#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>

//int cnt = 0;
//int fib(int n)
//{
//	cnt++;
//	if (n == 0)
//		return 1;
//	else if (n == 1)
//		return 2;
//	else
//		return fib(n - 1) + fib(n - 2);
//}
//
//void main()
//{
//	fib(8);
//	printf("%d", cnt);
//}
//----------------------------------------------------------------------------------------------------------------------

//int main()
//{
//	int x = 1;
//	do
//	{
//		printf("%2d\n", x++);
//	} while (x--);
//
//	return 0;
//}
//----------------------------------------------------------------------------------------------------------------------

//int main()
//{
//	int i = 1;
//	int j;
//	j = i++;
//	printf("%d %d", i, j);
//	return 0;
//}
//----------------------------------------------------------------------------------------------------------------------

//int main()
//{
//	int i = 10;
//	int j = 20;
//	int k = 3;
//	k *= i + j;
//	printf("%d", k);
//	return 0;
//
//}
//----------------------------------------------------------------------------------------------------------------------

//int a = 1;
//
//void test()
//{
//	int a = 2;
//	a += 1;
//}
//int main()
//{
//	test();
//	printf("%d\n", a);
//	return 0;
//}
//----------------------------------------------------------------------------------------------------------------------

//int main()
//{
//	int a = 0, c = 0;
//	do
//	{
//		--c;
//		a = a - 1;
//	} while (a > 0);
//	printf("%d", c);
//	return 0;
//}
//----------------------------------------------------------------------------------------------------------------------
//int main()
//{
//	double x = 2;
//	double y = x + 3 / 2;
//	printf("%lf", y);
//	return 0;
//}
//----------------------------------------------------------------------------------------------------------------------

//int main()
//{
//	int x = 0;
//	int y = 0;
//	int count = 0;
//	for (x = 0, y = 0; (y = 123) && (x < 4); x++)
//	{
//		count++;
//	}
//	printf("%d", count);
//	return 0;
//}
//----------------------------------------------------------------------------------------------------------------------
//int main()
//{
//	int year = 1009;
//	int* p = &year;
//	*p += 1;
//	(*p)++;
//	++(*p);
//	*p++;
//	printf("%d", year);
//
//	return 0;
//
//}
//--------------------------------------------------------------------------------------------------------------------------

//int main()
//{
//	printf("%d", 11 | 10);
//}
//----------------------------------------------------------------------------------------------------------------------

//【求最小公倍数】
//正整数A和正整数B 的最小公倍数是指 能被A和B整除的最小的正整数值，设计一个算法，求输入A和B的最小公倍数。

//方法一
//int main()
//{
//	int A = 0;
//	int B = 0;
//	scanf("%d %d", &A, &B);
//	int m = A > B ? A : B;
//	while (1)
//	{
//		if (m % A == 0 && m % B == 0)
//		{
//			break;
//		}
//		else
//			m++;
//	}
//	printf("%d", m);
//	return 0;
//}

//方法二
//int main()
//{
//	int A = 0;
//	int B = 0;
//	scanf("%d %d", &A, &B);
//	int i = 1;
//	for (i = 1; ; i++)
//	{
//		if ((A * i) % B == 0)
//		{
//			printf("%d", A * i);
//			break;
//		}
//
//	}
//	return 0;
//}

//方法三
//int main()
//{
//	int A = 0;
//	int B = 0;
//	scanf("%d %d", &A, &B);
//	int c = A % B;
//	int mul = A * B;
//	while (c !=0 )
//	{
//		A = B;
//		B = c;
//		c = A % B;
//	}
//	printf("%d", mul/B);
//	return 0;
//
//}
//----------------------------------------------------------------------------------------------------------------------

#include<string.h>
//【倒置字符串】
//将一句话的单词进行倒置，标点不倒置。比如 I like beijing.经过函数后变为：beijing.like I
//输入描述：
//每个测试输入包含1个测试用例： I like beijing.输入用例长度不超过100
//输出描述：
//依次输出倒置之后的字符串, 以空格分割

void reverse(char* left, char* right)
{
	while (left < right)
	{
		char tmp = 0;
		tmp = *left;
		*left = *right;
		*right = tmp;
		left++;
		right--;
	}
}
int main()
{
	char str[100] = { 0 };
	gets(str);
	//printf("%s\n", str);
	int len = strlen(str);
	//三步翻转法
	//1.字符串整体翻转

	reverse(str, str + len - 1);
	//printf("%s\n", str);
	//2.每个单词逆序
	char* start = str;
	while (*start)
	{
		char* end = start;
		while (*end != ' '&& *end != '\0')
		{
			end++;
		}
		reverse(start, end - 1);
		if (*end == ' ')
		{
			start = end + 1;
		}
		else
		{
			start = end;
		}

	}
	printf("%s\n", str);
	return 0;

}
